- gdsNum = product_id
- gdsName = product_name
- cateCode = category_id
- gdsPrice = price
- gdsStock = review_count
- gdsDes = product_detail_img
- gdsImg = image_url
- gdsDate = sysdate()

In [93]:
#!pip install cx_Oracle
#!pip install openpyxl

In [2]:
import requests
import urllib
import cx_Oracle
import os
import chardet
from openpyxl import Workbook
from bs4 import BeautifulSoup
import pandas as pd
import numpy as np

In [3]:
# 한글깨짐 방지
os.environ["NLS_LANG"] = ".AL32UTF8"

In [4]:
# DB와 연결된 코드
connection = cx_Oracle.connect(user='scott', password='tiger',
                              dsn='localhost/XE')
connection

In [5]:
cursor = connection.cursor()
# query test
cursor.execute("""
        SELECT userId,userName 
        FROM tbl_member""")
for userId, userName in cursor:
    print("Values:", userId, userName)

Values: 아이디 닉네임
Values: admin@test admin
Values: user@test user

In [6]:
df = pd.read_csv('./ohou_sug_data.csv')
df.head()

   gdsNum                                  sugNum
0   17087  335355, 355500, 365562, 450754, 832028
1  112197  231324, 342848, 354353, 414289, 450754
2  231324  112197, 312502, 354353, 357116, 414289
3  312502  231324, 354353, 357116, 365562, 414289
4  335355   17087, 355500, 365562, 450754, 832028

In [7]:
sql_insert = """insert into goods_sug(indexNo, gdsNum, sugNum) VALUES(:indexNo, :gdsNum, :sugNum)"""
for i in range(0,len(df)):
    cursor.execute(sql_insert,
                   indexNo=int(i),
                   gdsNum=int(df.iloc[i]['gdsNum']), 
                   sugNum=df.loc[i]['sugNum']
                  )

In [8]:
cursor.execute("""
        SELECT gdsNum,sugNum 
        FROM goods_sug""")
for gdsNum, sugNum in cursor:
    print("Values:", gdsNum, sugNum)

Values: 17087 335355, 355500, 365562, 450754, 832028
Values: 112197 231324, 342848, 354353, 414289, 450754
Values: 231324 112197, 312502, 354353, 357116, 414289
Values: 312502 231324, 354353, 357116, 365562, 414289
Values: 335355 17087, 355500, 365562, 450754, 832028
Values: 354353 112197, 231324, 312502, 342848, 357116
Values: 355500 17087, 335355, 365562, 450754, 832028
Values: 357116 231324, 312502, 354353, 475675, 599813
Values: 365562 17087, 312502, 335355, 342848, 354353
Values: 414289 112197, 231324, 312502, 354353, 446493
Values: 446493 31017, 231324, 354353, 414289, 475675
Values: 450754 17087, 112197, 312502, 335355, 354353
Values: 475675 112197, 231324, 312502, 354353, 357116
Values: 745069 231324, 312502, 342848, 354353, 365562

In [9]:
# 커밋
connection.commit()